Merge pull request #2 from rnataoliveira/chore/project-setup
chore: project setup, conventions and DDD documentation
